In [4]:
import pandas as pd
import sqlalchemy as sql

In [5]:
connect_string = ('mysql://root:mnbv@localhost:3306/atcs')

In [6]:
engine = sql.create_engine(connect_string)

In [19]:
df = pd.read_sql_table('persons',engine)

In [20]:
df

   PersonID LastName FirstName    Address    City
0         1     amit      raut     panvel  mumbai
1         1     amit     patil  dombivali  mumbai
2         3   nikhil    mhatre     alibag    ahsh

In [21]:
df.to_csv('new.csv',index=False)

In [15]:
query = "select LastName , Address from persons"
df1 = pd.read_sql_query(query, engine)

In [16]:
df1

  LastName    Address
0     amit     panvel
1     amit  dombivali
2   nikhil     alibag

In [11]:
df = pd.read_sql_table('persons',engine,columns= ['LastName','Address'])
df

  LastName    Address
0     amit     panvel
1     amit  dombivali
2   nikhil     alibag